<?php

/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */

/**
 * Description of City
 *
 * @author jiwei
 */
class City {

    static $province = array(
        "上海" => array("上海"),
        "云南" => array("宣威", "瑞丽", "楚雄", "个旧", "开远", "景洪", "玉溪", "大理", "芒市", "丽江", "昆明", "曲靖", "昭通", "思茅", "临沧", "保山", "安宁"),
        "内蒙古" => array("牙克石", "扎兰屯", "满洲里", "丰镇", "根河", "额尔古纳", "阿尔山", "霍林郭勒", "锡林浩特", "二连浩特", "鄂尔多斯", "通辽", "呼伦贝尔", "呼和浩特", "包头", "乌海", "赤峰", "乌兰浩特", "巴彦淖尔", "乌兰察布"),
        "北京" => array("北京"),
        "吉林" => array("临江", "延吉", "长春", "图们", "敦化", "珲春", "龙井", "和龙", "吉林市", "蛟河", "榆树", "九台", "德惠", "白山", "通化", "辽源", "四平", "白城", "松原", "公主岭", "桦甸", "舒兰", "梅河口", "大安", "磐石", "双辽", "集安", "洮南"),
        "四川" => array("乐山", "巴中", "泸州", "雅安", "宜宾", "绵阳", "内江", "遂宁", "广安", "南充", "彭州", "广元", "成都", "攀枝花", "西昌", "简阳", "万源", "峨眉山", "自贡", "崇州", "眉山", "资阳", "邛崃", "都江堰", "达州", "江油", "什邡", "广汉", "绵竹", "阆中", "华蓥", "德阳"),
        "天津" => array("天津"),
        "宁夏" => array("青铜峡", "银川", "灵武", "石嘴山", "吴忠", "中卫", "固原"),
        "安徽" => array("蚌埠", "宣城", "阜阳", "六安", "淮北", "宿州", "合肥", "淮南", "巢湖", "亳州", "界首", "黄山", "天长", "马鞍山", "芜湖", "滁州", "铜陵", "宁国", "桐城", "安庆", "明光", "池州"),
        "山东" => array("禹城", "莱芜", "聊城", "乳山", "青岛", "德州", "东营", "淄博", "潍坊", "威海", "日照", "临沂", "乐陵", "枣庄", "济宁", "泰安", "济南", "滨州", "招远", "蓬莱", "安丘", "昌邑", "章丘", "高密", "青州", "莱州", "莱阳", "龙口", "海阳", "栖霞", "寿光", "文登", "荣成", "菏泽", "胶州", "胶南", "即墨", "平度", "莱西", "临清", "肥城", "新泰", "邹城", "兖州", "曲阜", "滕州", "诸城", "烟台"),
        "山西" => array("原平", "高平", "潞城", "古交", "运城", "临汾", "晋中", "吕梁", "忻州", "晋城", "长治", "阳泉", "朔州", "大同", "太原", "孝义", "汾阳", "介休", "河津", "永济", "霍州", "侯马"),
        "广东" => array("云浮", "阳江", "湛江", "从化", "增城", "英德", "连州", "乐昌", "南雄", "兴宁", "普宁", "陆丰", "恩平", "台山", "肇庆", "佛山", "江门", "潮州", "东莞", "惠州", "汕尾", "揭阳", "汕头", "河源", "韶关", "清远", "深圳", "广州", "珠海", "梅州", "中山", "开平", "鹤山", "茂名", "雷州", "廉江", "吴川", "高州", "信宜", "化州", "阳春", "罗定", "四会", "高要"),
        "广西" => array("防城港", "北海", "钦州", "玉林", "贵港", "梧州", "柳州", "桂林", "南宁", "崇左", "百色", "合山", "宜州", "凭祥", "东兴", "北流", "桂平", "岑溪", "贺州", "来宾", "河池"),
        "新疆" => array("奎屯", "吐鲁番", "阿图什", "博乐", "昌吉", "阜康", "米泉", "库尔勒", "伊宁", "塔城", "和田", "阿克苏", "阿勒泰", "哈密", "乌鲁木齐", "克拉玛依", "石河子", "阿拉尔", "图木舒克", "五家渠", "北屯", "喀什", "乌苏"),
        "江苏" => array("仪征", "溧阳", "金坛", "新沂", "邳州", "江阴", "苏州", "无锡", "常州", "镇江", "南通", "泰州", "扬州", "盐城", "淮安", "宿迁", "连云港", "徐州", "常熟", "张家港", "太仓", "扬中", "句容", "丹阳", "兴化", "姜堰", "泰兴", "靖江", "南京", "高邮", "东台", "昆山", "宜兴", "吴江", "如皋", "海门", "启东", "大丰"),
        "江西" => array("鹰潭", "贵溪", "井冈山", "高安", "丰城", "德兴", "南康", "樟树", "瑞昌", "南昌", "九江", "景德镇", "新余", "萍乡", "赣州", "上饶", "抚州", "宜春", "吉安", "乐平", "瑞金"),
        "河北" => array("深州", "南宫", "三河", "邢台", "石家庄", "邯郸", "秦皇岛", "唐山", "保定", "冀州", "河间", "黄骅", "武安", "迁安", "霸州", "定州", "涿州", "安国", "高碑店", "泊头", "任丘", "张家口", "承德", "遵化", "新乐", "沙河", "鹿泉", "晋州", "藁城", "沧州", "廊坊", "衡水", "辛集"),
        "河南" => array("新密", "偃师", "孟州", "沁阳", "许昌", "卫辉", "巩义", "焦作", "辉县", "永城", "项城", "灵宝", "濮阳", "舞钢", "长葛", "禹州", "林州", "汝州", "新乡", "鹤壁", "三门峡", "南阳", "商丘", "周口", "驻马店", "信阳", "济源", "邓州", "荥阳", "登封", "义马", "郑州", "开封", "洛阳", "平顶山", "安阳", "漯河", "新郑"),
        "浙江" => array("衢州", "富阳", "建德", "奉化", "平湖", "余姚", "海宁", "桐乡", "临安", "慈溪", "金华", "舟山", "嘉兴", "湖州", "杭州", "台州", "温州", "丽水", "诸暨", "上虞", "宁波", "龙泉", "乐清", "绍兴", "温岭", "临海", "东阳", "嵊州", "江山", "兰溪", "瑞安", "永康", "义乌"),
        "海南" => array("东方市", "万宁市", "琼海市", "文昌市", "三亚市", "儋州市", "海口市", "五指山市"),
        "湖北" => array("宜昌", "随州", "仙桃", "天门", "潜江", "老河口", "丹江口", "大冶", "枣阳", "宜城", "钟祥", "汉川", "应城", "安陆", "麻城", "武穴", "荆州", "咸宁", "黄石", "恩施", "当阳", "广水", "宜都", "松滋", "洪湖", "枝江", "石首", "赤壁", "武汉", "十堰", "襄樊", "荆门", "孝感", "黄冈", "鄂州", "利川"),
        "湖南" => array("长沙", "津市", "沅江", "汨罗", "临湘", "常德", "醴陵", "湘乡", "韶山", "武冈", "洪江", "冷水江", "涟源", "吉首", "浏阳", "常宁", "张家界", "益阳", "岳阳", "株洲", "资兴", "郴州", "湘潭", "永州", "邵阳", "怀化", "娄底", "耒阳", "衡阳"),
        "甘肃" => array("玉门", "敦煌", "临夏", "合作", "白银", "陇南", "定西", "兰州", "嘉峪关", "金昌", "天水", "酒泉", "张掖", "武威", "庆阳", "平凉"),
        "福建" => array("福清", "龙岩", "宁德", "漳州", "泉州", "莆田", "三明", "南安", "南平", "福州", "长乐", "邵武", "福鼎", "福安", "漳平", "龙海", "晋江", "石狮", "永安", "建阳", "建瓯", "武夷山", "厦门"),
        "西藏" => array("日喀则", "拉萨"),
        "贵州" => array("贵阳", "安顺", "福泉", "兴义", "都匀", "凯里", "仁怀", "六盘水", "遵义", "毕节", "铜仁", "清镇", "赤水"),
        "辽宁" => array("凤城", "东港", "大石桥", "盖州", "凌海", "北宁", "兴城", "新民", "海城", "灯塔", "丹东", "鞍山", "辽阳", "沈阳", "大连", "朝阳", "阜新", "本溪", "铁岭", "抚顺", "营口", "盘锦", "开原", "调兵山", "凌源", "北票", "庄河", "普兰店", "瓦房店", "葫芦岛", "锦州"),
        "重庆" => array("重庆"),
        "陕西" => array("韩城", "安康", "华阴", "渭南", "兴平", "商洛", "榆林", "汉中", "西安", "延安", "铜川", "咸阳", "宝鸡"),
        "青海" => array("西宁", "格尔木", "德令哈"),
        "黑龙江" => array("讷河", "北安", "五大连池", "阿城", "铁力", "同江", "富锦", "虎林", "密山", "绥芬河", "海林", "宁安", "五常", "尚志", "双城", "安达", "海伦", "肇东", "哈尔滨", "齐齐哈尔", "黑河", "大庆", "伊春", "鹤岗", "佳木斯", "鸡西", "双鸭山", "牡丹江", "绥化", "七台河"),
    );

}
